Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: An extension method may declare parameters. If no namespace is specified then the first parameter that is not annotated with `@TemplateAttribute` is used to pass the base object, i.e. `org.acme.Item` in the first example. If matching any name or using a regular expression then a string method parameter needs to be used to pass the property name. Parameters annotated with `@TemplateAttribute` are obtained via `TemplateInstance#getAttribute()`. All other parameters are resolved when rendering the template and passed to the extension method.
ja_jp: 拡張メソッドはパラメーターを宣言することができます。名前空間が指定されていない場合、 `@TemplateAttribute` でアノテーションされていない最初のパラメーターが基底オブジェクトを渡すために使用されます。例：最初の例における `org.acme.Item` 。任意の名前に一致する場合、または正規表現を使用する場合は、文字列メソッドパラメータを使用してプロパティ名を渡す必要があります。 `@ TemplateAttribute` でアノテーションされたパラメーターは、 `TemplateInstance#getAttribute()` を介して取得されます。 他のすべてのパラメーターは、テンプレートをレンダリングするときに解決され、拡張メソッドに渡されます。

source: An extension method may declare parameters. If no namespace is specified then the first parameter that is not annotated with `@TemplateAttribute` is used to pass the base object, i.e. `org.acme.Item` in the first example. If matching any name or using a regular expression, then a string method parameter (not not annotated with `@TemplateAttribute`) needs to be used to pass the property name. Parameters annotated with `@TemplateAttribute` are obtained via `TemplateInstance#getAttribute()`. All other parameters are treated as virtual method parameters and resolved when rendering the template and passed to the extension method.
ja_jp: エクステンションメソッドはパラメーターを宣言できます。名前空間が指定されていない場合、`@TemplateAttribute` でアノテーションされていない最初のパラメーターがベースオブジェクトを渡すために使用されます。最初の例では `org.acme.Item` がこれに該当します。任意の名前に一致する場合、または正規表現を使用する場合は、プロパティー名を渡すために文字列メソッドパラメーター (アノテーション `@TemplateAttribute` が付けられていないもの) を使用する必要があります。`@TemplateAttribute` でアノテーションされたパラメーターは `TemplateInstance#getAttribute()` を介して取得されます。その他のすべてのパラメーターは、テンプレートのレンダリング時に解決され、エクステンションメソッドに渡されます。

source: An extension method may declare parameters. If no namespace is specified then the first parameter that is not annotated with `@TemplateAttribute` is used to pass the base object, i.e. `org.acme.Item` in the first example. If matching any name or using a regular expression, then a string method parameter needs to be used to pass the property name. Parameters annotated with `@TemplateAttribute` are obtained via `TemplateInstance#getAttribute()`. All other parameters are resolved when rendering the template and passed to the extension method.
ja_jp: エクステンションメソッドはパラメーターを宣言できます。 名前空間が指定されていない場合、アノテーション `@TemplateAttribute` が付けられていない最初のパラメーターがベースオブジェクトを渡すために使用されます。最初の例では、 `org.acme.Item` がこれに該当します。 任意の名前に一致する場合、または正規表現を使用する場合は、文字列メソッドパラメータを使用してプロパティ名を渡す必要があります。 アノテーション `@ TemplateAttribute` が付けられたパラメーターは、 `TemplateInstance#getAttribute()` を介して取得されます。 他のすべてのパラメーターは、テンプレートをレンダリングするときに解決され、エクステンションメソッドに渡されます。

source: An extension registers this substitution by producing an `ObjectSubstitutionBuildItem` as shown in this `TestProcessor#loadDSAPublicKey` fragment:
ja_jp: エクステンションは、次の `TestProcessor#loadDSAPublicKey` フラグメントに示すように、 `ObjectSubstitutionBuildItem` を生成することでこの置換を登録します。

source: An extension, apart from providing some runtime code to your application, also allows to tweak the build of your application and do all sorts of things at the build level. This is what we will focus on in this series.
ja_jp: エクステンションは、アプリケーションにランタイムコードを提供するだけでなく、アプリケーションのビルドを調整し、ビルドレベルであらゆる種類のことを行うことができます。このシリーズでは、この点に焦点を当てます。

source: An extensive list of examples can be seen in the https://github.com/quarkusio/quarkus/tree/main/integration-tests/spring-data-jpa[integration tests] directory which is located inside the Quarkus source code.
ja_jp: 多様な例のリストは、Quarkus ソースコード内の https://github.com/quarkusio/quarkus/tree/main/integration-tests/spring-data-jpa[統合テスト] にあります。

source: An extra `echo:name` scope will be requested during the authorization code flow.
ja_jp: 認可コードフロー中に、追加の `echo:name` スコープがリクエストされます。

source: An https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[Asciidoc syntax reference]
ja_jp: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[Asciidoc 構文リファレンス]

source: An imperative and reactive client for MongoDB
ja_jp: MongoDB 用の命令型およびリアクティブクライアント

source: An implementation of the `OpenshiftBuild` could look like this:
ja_jp: `OpenshiftBuild` の実装は以下のようになります:

source: An implication of 1) is that for small, short-lived applications a native executable may well be a better bet. Although the compiled code is not as well optimized it is available straight away.
ja_jp: 1)の意味するところは、小規模で短命なアプリケーションには、ネイティブ実行可能ファイルの方が適しているということです。コンパイルされたコードは最適化されていませんが、すぐに利用できます。

source: An important assumption of Quarkus is that the application lives in a closed world. You cannot dynamically add a jar at runtime to your Quarkus application and expect it to work.
ja_jp: Quarkusの重要な前提は、アプリケーションが閉じた世界に存在するということです。実行時に動的にjarをQuarkusアプリケーションに追加して、それが動作することを期待することはできません。

source: An important part of this support is that all repository generation is done at build time thus ensuring that all supported features work correctly in native mode. Moreover, developers know at build time whether or not their repository method names can be converted to proper JPQL queries. This also means that if a method name indicates that a field should be used that is not part of the Entity, developers will get the relevant error at build time.
ja_jp: このサポートで重要なのは、すべてのリポジトリー生成がビルド時に行われるため、サポートされているすべての機能がネイティブモードで正しく機能することを保証することです。さらに、開発者はビルド時に、リポジトリーメソッド名を適切な JPQL クエリーに変換できるかどうかを認識しています。これは、メソッド名がエンティティーの一部ではないフィールドを使用する必要があることを示している場合、開発者はビルド時に関連するエラーを受け取ることも意味します。

source: An important part of this support is that all repository generation is done at build time thus ensuring that all supported features work correctly in native mode. Moreover, developers know at build time whether their repository method names can be converted to proper JPQL queries. This also means that if a method name indicates that a field should be used that is not part of the Entity, developers will get the relevant error at build time.
ja_jp: このサポートで重要なのは、すべてのリポジトリー生成がビルド時に行われるため、サポートされているすべての機能がネイティブモードで正しく機能することを保証することです。さらに、開発者はビルド時に、リポジトリーメソッド名を適切な JPQL クエリーに変換できるかどうかを認識しています。これは、メソッド名がエンティティーの一部ではないフィールドを使用する必要があることを示している場合、開発者はビルド時に関連するエラーを受け取ることも意味します。

source: An important thing to note about the `Deployment` (or `StatefulSet`) is that is uses `yourDockerUsername/test-quarkus-app:1.0.0-SNAPSHOT` as the container image of the `Pod`. The name of the image is controlled by the Jib extension and can be customized using the usual `application.properties`.
ja_jp: `Deployment` (または `StatefulSet`) について注意すべき重要なことは、`Pod` のコンテナーイメージとして `yourDockerUsername/test-quarkus-app:1.0.0-SNAPSHOT` を使用していることです。イメージの名前は Jib エクステンションによって制御され、通常の `application.properties` を利用してカスタマイズすることができます。

source: An include statement for the `prerequisites.adoc` file
ja_jp: `prerequisites.adoc` ファイルの include ステートメント

source: An indexed property `foo.bar[0]` or `foo.bar[0].baz`, replace each character that is neither alphanumeric nor `\_` with `_`: `FOO_BAR_0_` or `FOO_BAR_0__BAZ`
ja_jp: インデックス付きプロパティ `foo.bar[0]` または `foo.bar[0].baz` の場合、英数字でも `_` でもない各文字を `_` で置換します : `FOO_BAR_0_` または `FOO_BAR_0__BAZ`

source: An initial stage (first leg) of the authorization code flow requires Quarkus OIDC to build a correct redirect URL and redirect the user to the OIDC provider to authenticate.
ja_jp: 認可コードフローの初期段階 (第 1 段階) では、Quarkus OIDC が正しいリダイレクト URL を構築し、ユーザーを認証のために OIDC プロバイダーにリダイレクトする必要があります。

source: An initializer may accept multiple parameters - each one is an injection point.
ja_jp: イニシャライザは複数のパラメーターを受け付けることができ、それぞれがインジェクションポイントとなります。

source: An initializer method must be annotated with `@Inject`.
ja_jp: イニシャライザメソッドには `@Inject` をアノテーションしなければなりません。

source: An injected `io.quarkus.scheduler.Scheduler` can be also used to schedule a job programmatically.
ja_jp: 注入された `io.quarkus.scheduler.Scheduler` は、プログラム的にジョブをスケジュールするために使用することもできます。

source: An injected `io.quarkus.scheduler.Scheduler` can be used to <<scheduler-reference.adoc#programmatic_scheduling,schedule a job programmatically>>. However, it is also possible to leverage the Quartz API directly. You can inject the underlying `org.quartz.Scheduler` in any bean:
ja_jp: 注入された `io.quarkus.scheduler.Scheduler` を使用して、 xref:scheduler-reference.adoc#programmatic_scheduling[プログラムでジョブをスケジュール] できます。 しかし、Quartz API を直接活用することも可能です。 基礎となる `org.quartz.Scheduler` を任意の Bean に注入できます：

source: An injected `io.quarkus.scheduler.Scheduler` can be used to xref:scheduler-reference.adoc#programmatic_scheduling[schedule a job programmatically]. However, it is also possible to leverage the Quartz API directly. You can inject the underlying `org.quartz.Scheduler` in any bean:
ja_jp: 注入された `io.quarkus.scheduler.Scheduler` を使用して、 xref:scheduler-reference.adoc#programmatic_scheduling[プログラム的にジョブをスケジュール] することができます。しかし、Quartz API を直接活用することも可能です。任意の Bean で基礎となる `org.quartz.Scheduler` を注入することができます：

source: An interactive terminal for dev mode
ja_jp: 開発モード用のインタラクティブターミナル

source: An interceptor binding annotation is always put on the interceptor type, and may be put on target types or methods.
ja_jp: インターセプター バインディング アノテーションは常にインターセプターの型に付けられ、ターゲットの型またはメソッドに付けることもできます。

source: An interceptor instance may be the target of dependency injection.
ja_jp: インターセプターインスタンスは、依存性注入の対象となる場合があります。

source: An interceptor may inject dependencies.
ja_jp: インターセプターは、依存性注入の対象となる場合があります。

source: An interceptor requires an implementation of `io.smallrye.config.ConfigSourceInterceptor`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceInterceptor` file.
ja_jp: インターセプターは、 `io.smallrye.config.ConfigSourceInterceptor` の実装が必要です。それぞれの実装は、 `META-INF/services/io.smallrye.config.ConfigSourceInterceptor` ファイルの link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader]メカニズムを介して登録する必要があります。

source: An interceptor requires an implementation of `io.smallrye.config.ConfigSourceInterceptor`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/io.smallrye.config.ConfigSourceInterceptor` file.
ja_jp: インターセプターには、 `io.smallrye.config.ConfigSourceInterceptor` の実装が必要です。 各実装には、 `META-INF/services/io.smallrye.config.ConfigSourceInterceptor` ファイル内の link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] メカニズムによる登録が必要です。

source: An interesting use case for the sampler is to activate and deactivate tracing export at runtime, according to this example:
ja_jp: サンプラーの興味深いユースケースは、次の例のように、実行時にトレーシングのエクスポートをアクティブ化または非アクティブ化することです。

source: An interface nested in the entity (though it could be a toplevel interface if you prefer)
ja_jp: エンティティ内にネストされたインターフェース (ただし、好みに応じてトップレベルインターフェースでも構いません)

source: An interval trigger defines a period between invocations. The period expression is based on the ISO-8601 duration format `PnDTnHnMn.nS` and the value of `@Scheduled#every()` is parsed with `java.time.Duration#parse(CharSequence)`. However, if an expression starts with a digit and ends with `d`, `P` prefix will be added automatically. If the expression only starts with a digit, `PT` prefix is added automatically. So for example, `15m` can be used instead of `PT15M` and is parsed as "15 minutes".
ja_jp: インターバルトリガーは、次の呼び出しまでの期間を定義します。 期間の表現は ISO-8601 期間形式 `PnDTnHnMn.nS` に基づいており、 `@Scheduled#every()` の値は `java.time.Duration#parse (CharSequence)` で解析されます。 ただし、式が数字で始まり、 `d` で終わる場合、 `P` 接頭辞が自動的に追加されます。式が数字でのみ始まる場合、 `PT` 接頭辞が自動的に追加されます。 たとえば、 `PT15M` の代わりに `15m` を使用すると、15 分として解析されます。

source: An interval trigger defines a period between invocations. The period expression is based on the ISO-8601 duration format `PnDTnHnMn.nS` and the value of `@Scheduled#every()` is parsed with `java.time.Duration#parse(CharSequence)`. However, if an expression starts with a digit then the `PT` prefix is added automatically. So for example, `15m` can be used instead of `PT15M` and is parsed as "15 minutes".
ja_jp: インターバルトリガーは、呼び出しの間の期間を定義します。期間式は ISO-8601 の期間フォーマット `PnDTnHnMn.nS` に基づいており、 `@Scheduled#every()` の値は `java.time.Duration#parse(CharSequence)` で解析されます。ただし、式が数字で始まる場合は、 `PT` の接頭辞が自動的に追加されます。例えば、 `PT15M` の代わりに `15m` を使用することができ、「15 分」と解析されます。

source: An introduction to Dev Services and a list of all extensions that support Dev Services and their configuration options.
ja_jp: Dev Services の紹介と、Dev Services をサポートするすべてのエクステンションとその設定オプションの一覧です。

source: An issue has been fixed regarding how the platforms are resolved in the dev tools. This issue could cause code.quarkus.io do go out of memory when creating projects with high number of extensions.
ja_jp: 開発ツールでのPlatformの解決方法に関する問題が修正されました。この問題により、エクステンションの数が多いプロジェクトを作成すると、code.quarkus.ioがメモリ不足になることがありました。

source: An link:/guides/amazon-ssm[extension for Amazon SSM] has been added.
ja_jp: link:/guides/amazon-ssm[Amazon SSM エクステンション]が追加されました。

source: An object - written into the HTTP response after having been encoded into JSON. The `content-type` header is set to `application/json` if not already set.
ja_jp: オブジェクト - JSON にエンコードされた後に HTTP レスポンスに書き込まれます。まだ設定されていない場合、 `content-type` ヘッダーは `application/json` に設定されます。

source: An object for manually controlling transaction boundaries (AtomicAction and many other useful classes are included in the extension). Refer https://narayana.io//docs/api/com/arjuna/ats/arjuna/AtomicAction.html[to the javadoc] for more detail.
ja_jp: トランザクションの境界を手動で制御するためのオブジェクト (AtomicAction と他の多くの便利なクラスがエクステンションに含まれています)。詳細は https://narayana.io//docs/api/com/arjuna/ats/arjuna/AtomicAction.html[to the javadoc] を参照してください。

source: An object of type `X` represents a blocking method in which the returned object is serialized and sent back to the client as a response.
ja_jp: `X` タイプのオブジェクトは、返されたオブジェクトがシリアライズされ、レスポンスとしてクライアントに送り返されるブロッキングメソッドを表します。

source: An object of type `X`: Represents a blocking method where the returned object is serialized and sent back to the client.
ja_jp: `X` タイプのオブジェクト: 返されたオブジェクトがシリアライズされてクライアントに送り返されるブロッキングメソッドを表します。

source: An offering is a set of extensions that are delivered and supported by a dedicated team or an organization under certain conditions. An extension may be associated with one or more offerings by adding `<offering-id>-support` field to its metadata, specifying support scope as its value. For example, here is a relevant snippet of metadata illustrating how it could look like:
ja_jp: 提供物とは、特定の条件下で専任のチームまたは組織によって提供され、サポートされるエクステンションのセットです。エクステンションは、メタデータに `<offering-id>-support` フィールドを追加し、その値としてサポートスコープを指定することで、1つ以上の提供物に関連付けることができます。例えば、以下はその例を示す関連メタデータの抜粋です。

source: An optimized `app.aot` cache file is generated from the recorded data.
ja_jp: 記録されたデータから最適化された `app.aot` キャッシュファイルが生成されます。

source: An optimized `app.aot` cache is generated
ja_jp: 最適化された `app.aot` キャッシュが生成される

source: An optional _parameter declaration_ is used to bind a Java type to expressions whose first part matches the parameter name. Parameter declarations are specified directly in a template.
ja_jp: オプションの _パラメーター宣言_ は、最初のパートがパラメーター名と一致する式に Java 型をバインドするために使用されます。パラメーター宣言はテンプレートで直接指定します。

source: An optional logo representing the extension or its domain
ja_jp: エクステンションまたはそのドメインを表すオプションのロゴ

source: An optional response to send to the client instead of continuing the filter chain, or an empty value if the filter chain should proceed
ja_jp: フィルターチェーンを続行する代わりにクライアントに送信するオプションのレスポンス、またはフィルターチェーンを続行する必要がある場合は空の値

source: An outdated version of the `quarkus-resteasy-reactive` is recommended to be removed in favor of the one managed by the `quarkus-bom`
ja_jp: `quarkus-bom` によって管理されていることから、 `quarkus-resteasy-reactive` の古いバージョンを削除することが推奨されます。

source: An underlying library does not provide metrics (or there is no library at all) and you want to add instrumentation.
ja_jp: 基礎となるライブラリーがメトリクスを提供しない (またはライブラリーがまったくない) ため、インストルメンテーションを追加する必要があります。

source: An underlying library used by the extension is using a specific Metrics API directly (either MP Metrics, Micrometer, or some other).
ja_jp: エクステンションで使用される基盤となるライブラリーは、特定のメトリクス API (MP Metrics、Micrometer、またはその他) を直接使用します。

source: An underlying library uses its own mechanism for collecting metrics and makes them available at runtime using its own API, e.g. Hibernate's `Statistics` class, or Vert.x `MetricsOptions`.
ja_jp: 基盤となるライブラリーは、メトリクスを収集するために独自のメカニズムを使用し、Hibernate の `Statistics` クラスや Vert.x `MetricsOptions` などの独自の API を使用してランタイムにそれらを利用できるようにします。

source: An update to GraalVM 20.2
ja_jp: GraalVM 20.2へのアップデート

source: An xref:building-my-first-extension.adoc[extension structure] in place
ja_jp: xref:building-my-first-extension.adoc[エクステンション構造]

source: An xref:expressions[expression] outputs an evaluated value. It consists of one or more parts. A part may represent simple properties: `{foo}`, `{item.name}`, and virtual methods: `{item.get(name)}`, `{name ?: 'John'}`. An expression may also start with a namespace: `{inject:colors}`.
ja_jp: xref:expressions[式] は、評価された値を出力するものです。1つまたは複数のパーツから構成されます。パーツは、単純なプロパティ： `{foo}` `{item.name}` や、仮想メソッドを表します： `{item.get(name)}` `{name ?: 'John'}` 。また、式は名前空間で始まることもあります： `{inject:colors}` 。

source: Analogous to `@RegisterForReflection`, you can use `@RegisterForProxy` to register interfaces for dynamic proxy:
ja_jp: `@RegisterForReflection` と同様に、`@RegisterForProxy` を使用して動的プロキシーのインターフェイスを登録できます。

source: Analogously, you can use the `quarkus.debug.transformed-classes-dir` and `quarkus.debug.generated-sources-dir` properties to dump the relevant output.
ja_jp: 同様に、 `quarkus.debug.transformed-classes-dir` プロパティーと `quarkus.debug.generated-sources-dir` プロパティーを使用して、関連する出力をダンプできます。

source: Analogously, you can use the `quarkus.debug.transformed-classes-dir` and `quarkus.debug.transformed-classes-dir` properties to dump the relevant output.
ja_jp: 同様に、 `quarkus.debug.transformed-classes-dir` プロパティーと `quarkus.debug.transformed-classes-dir` プロパティーを使用して、関連する出力をダンプできます。

source: Analysis is a big part of full text search: it defines how text will be processed when indexing or building search queries.
ja_jp: アナライズは全文検索の大きな部分を占めています。インデックス作成や検索クエリ構築の際に、テキストがどのように処理されるかを定義します。

source: Analytics configurations are stored at the `.redhat` folder in the user's home directory:
ja_jp: 分析設定は、ユーザーのホーム・ディレクトリーにある `.redhat` フォルダーに保存されます：

source: Analyze the update command output for potential instructions and perform the suggested tasks if necessary.
ja_jp: 潜在的な指示について更新コマンドの出力を分析し、必要に応じて提案されたタスクを実行します。

source: Analyzers and normalizers
ja_jp: アナライザーとノーマライザー

source: Anchor with a custom URL caption example
ja_jp: カスタム URL キャプションのアンカーの例

source: Anchored ID creation example
ja_jp: アンカー ID の作成例

source: Anchors for in-file and cross-file navigation
ja_jp: ファイル内およびファイル間ナビゲーションのためのアンカー

source: And SLF4J:
ja_jp: そして Slf4j:

source: And __all__ of our developers have enough working knowledge to build, test, and deploy services in hours not days or weeks.
ja_jp: また、 __すべての__ 開発者は、数日や数週間ではなく、数時間でサービスを構築、テスト、デプロイできるだけの実務知識を持っています。

source: And add the following configuration property: `quarkus.oidc.roles.source=accesstoken`.
ja_jp: そして、次の設定プロパティーを追加します。 `quarkus.oidc.roles.source=accesstoken`。

source: And all this functionality is provided in a distributed, highly scalable, elastic, fault-tolerant, and secure manner.
ja_jp: そして、これらの機能はすべて、分散型で、拡張性が高く、弾力性があり、耐障害性があり、安全な方法で提供されます。

source: And also `test-quarkus-app-pull-secret` is added to the `imagePullSecrets` list.
ja_jp: また、 `test-quarkus-app-pull-secret` が `imagePullSecrets` リストに追加されます。

source: And also there are a lot more fields to store than just a public key, but we will help you with that.
ja_jp: また、公開鍵以外にも保存するフィールドはたくさんありますが、それについては私たちがお手伝いします。

source: And another class with the details of the Applicant:
ja_jp: そして、申請者の詳細を記載した別のクラスを用意します:

source: And apply it:
ja_jp: そして、それを以下のように適用します:

source: And as usual its fair share of bugfixes and small improvements all over the place.
ja_jp: また、いつものようにバグフィックスや小さな改良が随所に施されています。

source: And at the end of the guide, the extensive configuration documentation:
ja_jp: そして、ガイドの最後には、充実した設定資料が掲載されています:

source: And configure it as an OIDC `service` application which will only fetch public verification keys from Auth0. The configuration for this microservice should only have a single line:
ja_jp: これを、Auth0 から公開検証キーのみを取得する OIDC `service` アプリケーションとして設定します。 このマイクロサービスの設定は、次の 1 行のみとなるはずです。

source: And configure the Maven Surefire plugin as follows:
ja_jp: そして、Maven Surefire プラグインを次のように設定します。

source: And contains query methods, annotated with either `@Find` or `@HQL` or even `@SQL` (for native queries), or `default` methods with implementation of queries
ja_jp: そして、`@Find` または `@HQL`、あるいは `@SQL` (ネイティブクエリ用) のいずれかでアノテーションが付けられたクエリメソッド、またはクエリの実装を含む `default` メソッドが含まれる

source: And describe your endpoints like this:
ja_jp: そして、エンドポイントをこのように記述します:

source: And executed using `java -jar target/quarkus-app/quarkus-run.jar`.
ja_jp: そして、 `java -jar target/quarkus-app/quarkus-run.jar` を使って実行します。

source: And executed using `java -jar target/quarkus-app/quarkus-run.jar`:
ja_jp: そして、 `java -jar target/quarkus-app/quarkus-run.jar` を使って実行します:

source: And executed with `java -jar target/quarkus-app/quarkus-run.jar`.
ja_jp: そして、 `java -jar target/quarkus-app/quarkus-run.jar` で実行されます。

source: And finally `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/Aggregation.java`, which will be used to keep track of the aggregated values while the events are processed in the streaming pipeline:
ja_jp: そして最後に `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/Aggregation.java` 、イベントがストリーミング・パイプラインで処理されている間、集約された値を追跡するために使用されます。

source: And finally we now have enabled for anyone with a GitHub account to comment on the blog.
ja_jp: そして最後に、GitHubのアカウントを持っている人なら誰でもブログにコメントできるようになりました。

source: And finally, run it with:
ja_jp: そして最後に、以下を実行します:

source: And finally, write the test code. Given the Wiremock-based resource above, the first test invocation should return the `access_token_1` access token, which will expire in 4 seconds. Use `awaitility` to wait for about 5 seconds, and now the next test invocation should return the `access_token_2` access token, which confirms the expired `access_token_1` access token has been refreshed.
ja_jp: そして最後にテストコードを書きます。上記の Wiremock ベースのリソースがある場合、最初のテスト起動では `access_token_1` アクセストークンが返されますが、このアクセストークンは 4 秒で期限切れになります。 `awaitility` を使用して約 5 秒間待つと、次のテスト起動時に `access_token_2` アクセストークンが返され、期限切れの `access_token_1` アクセストークンが更新されたことが確認できます。

source: And for something that never gets old, i.e. cross-platform portability, your application remains _"Write Once, Run Anywhere"_, without managing different `.so` or `.dll` files for different architectures.
ja_jp: そして、古びることのないクロスプラットフォームのポータビリティーについても、アーキテクチャーごとに異なる `.so` や `.dll` ファイルを管理することなく、アプリケーションは _"Write Once, Run Anywhere"_ 状態を維持できます。

source: And for text:
ja_jp: そしてテキストの場合:

source: And for the least 'auto-magical' usage in the tests, simply disable both (Dev Resources are already disabled by default):
ja_jp: テストにおいて '魔法のような自動処理' の使用を最小限に抑えるには、両方を無効します (Dev Resources はデフォルトですでに無効になっています)。

source: And for your usage code, the only change is the standard use of manually calling `update()`, and using `insert()` instead of `persist()`:
ja_jp: そして、使用するコードについて言えば、唯一の変更点は、`update()` を手動で呼び出す標準的な使用方法と、`persist()` の代わりに `insert()` を使用することです。

source: And here comes 1.13.7.Final, our (most probably!) last round of bugfixes for the 1.13 release.
ja_jp: 1.13リリースのための（おそらく！）最後のバグフィックスである1.13.7.Finalがやって来ました 。
